<?php
/**
 * Что выведет код на каждом шаге? Почему?
 */

class A {

  public function foo() {
    /* переменная $x будет проинициализирована только при первом вызове функции foo */
    static $x = 0;
    echo ++$x;
  }

}

$a1 = new A();
$a2 = new A();

/* несмотря на то что объекты разные, но метод они используют один (!),
   это метод foo класса A. И т.к. значение $x в методе сохраняется между вызовами
   и инкрементируется получим в результате 1234 в качестве вывода. */
$a1->foo(); // 1
$a2->foo(); // 2
$a1->foo(); // 3
$a2->foo(); // 4
